# InsertableObject Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsertableObject Class
Members See Also
---
A base class you all types that are insertable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class InsertableObject : ElementType
```

Visual Basic
---
```text
Public Class InsertableObject _
	Inherits ElementType
```

Visual C++
---
```text
public ref class InsertableObject : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..InsertableObject Autodesk.Revit.DB..::..FamilySymbol
# See Also
InsertableObject Members
Autodesk.Revit.DB Namespace